// task 1

let x = 1;
let y = 2;

let res1 = String(x) + String(y);
console.log(res1); 
console.log(typeof res1); 

let res2 = String(Boolean(x < y)) + String(y);
console.log(res2); 
console.log(typeof res2); 

let res3 = x < y; 
console.log(res3); 
console.log(typeof res3);

let res4 = typeof x / y;
console.log(res4);
console.log(typeof res4); 

// task 2

let n = +prompt("Enter your number: ");
if ( n > 0 && n % 2 === 0) {
  console.log("Your number is even positive number");
} else {
  console.log("Your number is not an even positive number");
}
if (n % 7 === 0) {
  console.log("Your number is a multiple of 7");
} else {
  console.log("Your number is not a multiple of 7");
}

/*3. Створіть порожній масив;
1) У перший елемент масиву запишіть будь-яке число;
2) У другий елемент масиву запишіть будь-який рядок;
3) У третій елемент масиву запишіть будь-яке логічне значення;
4) У четвертий елемент масиву запишіть значення null;
5) Виведіть на екран число елементів, яке зберігається в масиві;
6) Запитайте у користувача ввести будь-яке значення і запишіть це значення в п'ятий елемент масиву;
7) Виведіть на екран п'ятий елемент масиву.
8) Видаліть 1-ий елемент масиву і виведіть масив на екран.*/

const array = [];
array[0] = 25;
array[1] = "string";
array[2] = true;
array[3] = null;
// console.log(array);
alert(`Array has ${array.length} elements`);
array[4] = +prompt("Enter any value: ");
alert(array[4]);
array.shift(0);
alert(array.shift());
console.log(array);


/*4. Напишіть програму, яка об’єднує всі наявні елементи масиву в стрічку і розділяє їх символом “*”.
Початковий масив:*/

let cities = ["Rome", "Lviv", "Warsaw"]; 
let newCities = cities.splice("*");
alert (newCities);

/*Результат:
"Rome*Lviv*Warsaw"

5. Використовуючи функцію prompt() задайте користувачу питання про досягнення ним повнолітнього віку. Результат запишіть в змінну isAdult. В залежності від отриманого значення виведіть відповідне повідомлення про статус особи. Наприклад: при виконанні умови вік більше 18 вивести “Ви досягли повнолітнього віку”. Якщо вік менше 18 років вивести “Ви ще надто молоді”, 

6. Користувач вводить три довжини сторін трикутника (використовуйте prompt () три рази для введення кожної сторони).
Необхідно 
	a) визначити і вивести в консоль площу трикутника 
	b) перевірити чи цей трикутник є прямокутним і вивести в консоль результат перевірки.
Здійснювати перевірку чи введені користувачем значення коректні, в іншому випадку вивести 'Incorrect data‘. Результат обчислення площі трикутника виводити в консоль з точністю 3 знаки після коми (наприклад:  8.42355465 =>  8.424).  

7. Написати умовну конструкцію, яка в залежності від часу доби виводитиме відповідне привітання. Потрібно отримати реальний час доби із системи. Зробити 2 способами через 2 різних умовних оператора.
В діапазоні годин 23-5 – має виводитися привітання “Доброї ночі”
В діапазоні годин 5-11 – має виводитися привітання “Доброго ранку”
В діапазоні годин 11-17 – має виводитися привітання “Доброго дня”
В діапазоні годин 17-23 – має виводитися привітання “Доброго вечора”.

*/
